app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.books.any? %>
---
SELECT  1 AS one FROM "books" WHERE "books"."user_id" = ? LIMIT 1  [["user_id", 1046959424]]